public_html/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guilherme G. Schardong</title>
<meta name="generator" content="Org Mode" />
<meta name="referrer" content="origin" />
<link rel="stylesheet" href="css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Guilherme G. Schardong</h1>
<div class="pgp"><a href="../res/key.txt"><tt>6EF2 6885 8BD4 F608 58AF 4763 BC05 5498 F7E7 7E74</tt></a></div>
<hr />

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
I'm currently a Research Scientist at <a href="https://www.isr.uc.pt/">Institute of Systems and Robotics, University of Coimbra</a>, where I work on projects with the <a href="https://visteam.isr.uc.pt/home">Visual Information Security Team (VISTEAM)</a>. Up to January 2022, I was a research fellow at GALGOS/PUC-Rio, with experience on oil&amp;gas industry from projects with PETROBRAS on well-testing and reservoir model inference. From 2020 to 2024 I was also a part-time post-doc at <a href="https://www.visgraf.impa.br/home/">Visgraf/IMPA</a>, where I worked on computer graphics and machine learning, with emphasis on implicit function reconstruction and rendering.
</p>
</div>
</div>

<div id="outline-container-backg" class="outline-2">
<h2 id="backg">Background</h2>
<div class="outline-text-2" id="text-backg">
<p>
I got my Bachelor's degree in Computer Science from UFSM in 2012 and a Master's degree in Informatics in the same university, in 2014, advised by prof. <a href="http://www.inf.ufsm.br/~pozzer">Cesar Pozzer</a>. In 2018 I got my D.Sc. in Informatics at PUC-Rio, as a member of GALGOS. From 2014 to 2016 I worked as a developer under prof. <a href="http://www.inf.puc-rio.br/~celes">Waldemar Celes</a> on the Reservoir Visualization group on Tecgraf/PUC-Rio Institute. In 2016 I started working with prof. <a href="https://www.inf.puc-rio.br/~lopes">Hélio Lopes</a> (being advised by him since 2015) and was co-advised by prof. <a href="https://www.inf.puc-rio.br/~simone">Simone Barbosa</a> during my doctorate. I'm currently a Research Scientist at the Institute for Systems an Robotics, University of Coimbra at the <a href="https://visteam.isr.uc.pt/home">VISTEAM</a> group, led by prof <a href="https://home.deec.uc.pt/~nunogon/">Nuno Gonçalves</a>. I'm also colaborate on a regular basis with prof. <a href="https://www.impa.br/~lvelho">Luiz Velho</a> from Visgraf/IMPA.
</p>
</div>
</div>

<div id="outline-container-research" class="outline-2">
<h2 id="research">Research</h2>
<div class="outline-text-2" id="text-research">
<p>
My current research interests involve mainly AI for Graphics, Vision and Implicit Neural Representations.
</p>
</div>

<div id="outline-container-orgeebb77e" class="outline-3">
<h3 id="orgeebb77e">Journal Papers</h3>
<div class="outline-text-3" id="text-orgeebb77e">
<ol class="org-ol">
<li>Democratizing interactivity: An overview of interfaces for multimedia machine learning
[<a href="https://doi.org/10.1016/j.cag.2025.104412">Paper link</a>] [<a href="papers/20250901-democratizing.html">Info</a>]</li>
<li><b>Geometric implicit neural representations for signed distance functions</b>
[<a href="https://doi.org/10.1016/j.cag.2024.104085">Paper link</a>] [<a href="papers/20241201-geometricinr.html">Info</a>]</li>
<li>MR-Net: Multiresolution sinusoidal neural networks
[<a href="https://visgraf.github.io/mrnet-img/">Project page</a>] [<a href="https://doi.org/10.1016/j.cag.2023.05.014">Paper link</a>] [<a href="papers/20230801-mrnet.html">Info</a>]</li>
<li><b>Exploring Differential Geometry in Neural Implicits</b>
[<a href="https://dsilvavinicius.github.io/i3d">Project page</a>] [<a href="https://dsilvavinicius.github.io/i3d">Code repository</a>] <a href="https://www.sciencedirect.com/science/article/pii/S0097849322001649">[Paper link</a>] [<a href="https://arxiv.org/abs/2201.09263">ArXiv link</a>] [<a href="papers/20220913-i3d.html">Info</a>]</li>
</ol>
</div>
</div>

<div id="outline-container-org454f30b" class="outline-3">
<h3 id="org454f30b">Conference Papers</h3>
<div class="outline-text-3" id="text-org454f30b">
<ol class="org-ol">
<li><b>FLOWING: Implicit Neural Flows for Structure-Preserving Morphing</b>
[<a href="https://schardong.github.io/flowing">Project page</a>] [<a href="https://github.com/schardong/flowing">Code repository</a>] [<a href="https://arxiv.org/abs/2510.09537">ArXiv link</a>] [<a href="papers/20251203-flowing.html">Info</a>]</li>
<li>RiemStega: Covariance-Based Loss for Print-Proof Transmission of Data in Images
[<a href="https://openaccess.thecvf.com/content/WACV2025/html/Cruz_RiemStega_Covariance-Based_Loss_for_Print-Proof_Transmission_of_Data_in_Images_WACV_2025_paper.html">Paper link</a>] [<a href="papers/20250226-riemstega.html">Info</a>]</li>
<li>INTERACT-NET: An Interactive Interface for Multimedia Machine Learning
[<a href="https://ieeexplore.ieee.org/document/10716312">Paper link</a>] [<a href="papers/20240930-interactnet.html">Info</a>]</li>
<li><b>Neural Implicit Morphing of Face Images</b>
<a href="https://schardong.github.io/ifmorph">[Project page</a>] [<a href="https://github.com/schardong/ifmorph">Code repository</a>] [<a href="https://openaccess.thecvf.com/content/CVPR2024/html/Schardong_Neural_Implicit_Morphing_of_Face_Images_CVPR_2024_paper.html">Paper link</a>] [<a href="https://arxiv.org/abs/2308.13888">ArXiv link</a>] [<a href="papers/20240619-ifmorph.html">Info</a>]</li>
<li>How to train your (neural) dragon
[<a href="https://www.lschirmer.com/sibgrapi23">Project page</a>] [<a href="https://colab.research.google.com/drive/1bkTG6lzx-yFwyosp55KkmPOKKizmmpHY?usp=sharing">Code repository</a>] [<a href="https://drive.google.com/file/d/1uYsp0XaTFWVLnZ8yQp7sS7g22LF7GM6H/view">Paper link</a>] [<a href="papers/20231106-neural-dragon.html">Info</a>]</li>
<li>High-Resolution Detection of Earth Structural Heterogeneities from Seismic Amplitudes using Convolutional Neural Networks with Attention layers
[<a href="https://openaccess.thecvf.com/content/CVPR2024W/LXCV/html/Schirmer_High-Resolution_Detection_of_Earth_Structural_Heterogeneities_from_Seismic_Amplitudes_using_CVPRW_2024_paper.html?trk=public_post_comment-text">Paper link</a>] [<a href="https://arxiv.org/abs/2404.10170">ArXiv link</a>] <a href="papers/20240617-hires-seismic.html">[Info</a>]</li>
<li><b>Neural Implicit Surface Evolution</b>
[<a href="https://dsilvavinicius.github.io/nise">Project page</a>] [<a href="https://github.com/dsilvavinicius/nise">Code repository</a>] <a href="https://openaccess.thecvf.com/content/ICCV2023/html/Novello_Neural_Implicit_Surface_Evolution_ICCV_2023_paper.html">[Paper link]​</a> [<a href="https://arxiv.org/abs/2201.09636">ArXiv link</a>] [<a href="papers/20231004-nise.html">Info</a>]</li>
<li>Multiresolution Neural Networks for Imaging
[<a href="https://visgraf.github.io/mrnet-img/">Project page</a>] [<a href="https://ieeexplore.ieee.org/document/9991765">Paper link</a>] [<a href="https://arxiv.org/abs/2208.11813">ArXiv link</a>] [<a href="papers/20221024-mrnet-sibgrapi.html">Info</a>]</li>
</ol>
</div>
</div>

<div id="outline-container-orgf5b4a6a" class="outline-3">
<h3 id="orgf5b4a6a">Patents</h3>
<div class="outline-text-3" id="text-orgf5b4a6a">
<ol class="org-ol">
<li>Method for detecting anomalies in the well and oil reservoir system using artificial intelligence
[<a href="https://patents.google.com/patent/US20240229642A1/en">Patent link</a>] [<a href="papers/20240711-siarp.html">Info</a>]</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-03-31</p>
<p class="date">Created: 2025-10-23 Thu 13:47</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
